[
  {
    "exits": [
      {
        "direction": "SOUTH",
        "toRoomReferenceName": "commonroom"
      }
    ],
    "description": "I open my eyes, feeling dizzy for a moment. It feels like I\u0027ve been asleep for a very long time and I need som time to adjust\nto being awake again. I\u0027m laying in what looks like some kind of sleeping pod, maybe I really have been sleeping for a long time... but why?\nI try to recall, but there is nothing. I can\u0027t remember. But why am I here? How did I even get here? Who... Who am I? I don\u0027t know.\n\u003cbr/\u003eI don\u0027t remember anything. \u003cbr/\u003ePanic starts to rise, making it hard to breathe. This is not the time to completely freak out. \nI inhale deeply, pulse still beating in my ears. \nMaybe I can figure everything out if I just look around. Maybe I can get out of here and go home, wherever that is...\nI cautiously start to look around and notice a door on the south wall.",
    "abstractItems": [
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "The pod is closed and someone seems to be laying inside.",
          "afarDescription": "My brows furrow as I take in my surroundings. Ten. I can count to ten pods in this room.",
          "referenceName": "pod"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "My pod is open.",
          "afarDescription": "Next to me is the pod I climbed out of.",
          "referenceName": "my pod"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "It looks like someone was lying here a long time ago.",
          "afarDescription": "The pod across from mine seems to be... open?",
          "referenceName": "open pod"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "afarDescription": "\u003ci\u003e\u003cp style\u003d\u0027color:#969696\u0027\u003eIf you are unsure or need help with what commands to use, type \u0027help\u0027 to access the help menu.\u003c/p\u003e\u003ci/\u003e"
        }
      }
    ],
    "referenceName": "podroom"
  },
  {
    "exits": [
      {
        "direction": "NORTH",
        "toRoomReferenceName": "podroom"
      },
      {
        "direction": "SOUTH",
        "toRoomReferenceName": "oxygenroom"
      }
    ],
    "description": "Exits: North, East, South.\u003cbr/\u003eI start to look around when a low, happy melody starts playing. \nAbove the east door a screen light up and a text appears. \u003cbr/\u003e\u0027Welcome back to the new and improved Earth!\u0027 I read. \u003cbr/\u003eI wonder what this means... Confused I continue to scan the room.",
    "abstractItems": [
      {
        "type": "project.text.adventure.gameitems.Box",
        "data": {
          "content": {
            "type": "project.text.adventure.gameitems.Article",
            "data": {
              "description": "The few cans that are left seems to contain something that looks like soup and \nsome beans. This doesn\u0027t look like it will last for long, I better save it for later.",
              "afarDescription": "The cabinet only has a few cans of food left. On the bottom shelf there is \nseveral open and empty cans. I wonder who ate all this...",
              "referenceName": "cans"
            }
          },
          "open": false,
          "winsGame": false,
          "description": "There is a metal handle on the cabinet and a small sign saying \u0027Food\u0027.",
          "afarDescription": "I see a cabinet on the west wall.",
          "referenceName": "cabinet"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "The couch looks comfortable but I decide that now is not the time for a break.",
          "afarDescription": "In the north east corner of the room, there is a light blue couch filled with red pillows.",
          "referenceName": "couch"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Obstacle",
        "data": {
          "keyReferenceName": "keycard",
          "lockable": {
            "type": "project.text.adventure.gameitems.Exit",
            "data": {
              "direction": "EAST",
              "toRoomReferenceName": "hallway"
            }
          },
          "givesGameOver": false,
          "description": "I pull the handle on the door but nothing happens, the door is locked. There must be a key somewhere.",
          "referenceName": "east door"
        }
      }
    ],
    "referenceName": "commonroom"
  },
  {
    "exits": [
      {
        "direction": "NORTH",
        "toRoomReferenceName": "commonroom"
      }
    ],
    "description": "Exits: north.\u003cbr/\u003eAs I walk into the room, I forget to breathe. The floor seems to be wobbling as I\nlet my gaze wander over the glass walls, separating me from the endless space outside.\nI am... in space?",
    "abstractItems": [
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "The tree\u0027s thickness surpasses any other tree I\u0027ve ever seen... How old is it?",
          "afarDescription": "There is a huge tree in the middle of the room, its crown easily pressing against the ceiling.",
          "referenceName": "tree"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "As I remove some leaves I freeze. \u003cbr/\u003eA skull is staring right back at me with its dead, cold stare. \nI take a huge breath to regain my composure as I let my gaze wander over the skeleton. \nEverything has decomposed, except for the pants. Is that something in the pocket?",
          "afarDescription": "Under the tree there is a pile of leaves. I notice something white in between them.",
          "referenceName": "leaves"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Key",
        "data": {
          "description": "The note is wrinkled, certainly very old. I squint to read the cursive handwriting. \u003cbr/\u003e\u0027\u003ci\u003eTo whom it may concern, \u003cbr/\u003eAs I\u0027m laying in the soil of my own regrets, I realize I\u0027ve lived a fool\u0027s life. \u003cbr/\u003eIt is funny. I’ve been alive for so long and yet I do not know what to make of this empty page. \u003cbr/\u003eWhat do I want to say with the final breath I take? I am running out of oxygen and yet I can’t bring myself to be angry. \u003cbr/\u003eI am just sad. \u003cbr/\u003eI miss my wife. I wish she would have woken up with me. I love you, Helen. \u003cbr/\u003eI miss my children. I hope I was a good father. \u003cbr/\u003eI hope I was good. \u003cbr/\u003eI hope I didn\u0027t deserve this.\u003c/i\u003e\u0027 \u003cbr/\u003e... \u003cbr/\u003eWhat happened to him?",
          "afarDescription": "There seems to be a note laying next to this pile of leaves.",
          "referenceName": "note"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Box",
        "data": {
          "content": {
            "type": "project.text.adventure.gameitems.Key",
            "data": {
              "description": "There is a photo of a man on the card. \u0027Robert Clay\u0027.... hm.",
              "afarDescription": "There is a keycard inside the pocket. Maybe worth taking?",
              "referenceName": "keycard"
            }
          },
          "open": false,
          "winsGame": false,
          "description": "There seems to be something inside the pocket.",
          "referenceName": "pocket"
        }
      }
    ],
    "referenceName": "oxygenroom"
  },
  {
    "exits": [
      {
        "direction": "WEST",
        "toRoomReferenceName": "commonroom"
      },
      {
        "direction": "NORTH",
        "toRoomReferenceName": "transitionroom"
      }
    ],
    "description": "Exits: West and North.\u003cbr/\u003eThere is a giant window through which I can see the endless space, covering all of the south and the east wall. \nThe knowledge that I am alone in space is kind of crushing...",
    "abstractItems": [
      {
        "type": "project.text.adventure.gameitems.Obstacle",
        "data": {
          "lockable": {
            "type": "project.text.adventure.gameitems.Box",
            "data": {
              "open": false,
              "winsGame": true,
              "description": "The hatch looks easy enough to open without struggle.",
              "afarDescription": "By the west wall there is a hatch with an exit-sign above it. I see that there is something outside that has connencted to the hatch and as I walk closer I can see it more clearly, it must be the ship coming to get me!",
              "referenceName": "hatch"
            }
          },
          "givesGameOver": true,
          "description": "The hatch looks easy enough to open without struggle.",
          "afarDescription": "By the west wall there is seems to be a hatch with an exit-sign above it.",
          "referenceName": "hatch"
        }
      }
    ],
    "referenceName": "hallway"
  },
  {
    "exits": [
      {
        "direction": "SOUTH",
        "toRoomReferenceName": "hallway"
      },
      {
        "direction": "WEST",
        "toRoomReferenceName": "researcharea"
      },
      {
        "direction": "NORTH",
        "toRoomReferenceName": "medicalfacility"
      }
    ],
    "description": "Exits: North, West, East, South.",
    "abstractItems": [
      {
        "type": "project.text.adventure.gameitems.Robot",
        "data": {
          "wires": [
            {
              "feature": "As fast as I hear the small snip of the cut wire, all my senses go numb as a huge explosion emerges...",
              "correctWire": false,
              "givesGameOver": true,
              "description": "A red wire is drawn across the surface.",
              "referenceName": "red wire"
            },
            {
              "feature": "As fast as the knife severs the wire, the robot lets out a loud buzzing noise. \nElectricity shoots from its neck, only for a second, before it falls to the ground with a loud thud.",
              "correctWire": true,
              "givesGameOver": false,
              "description": "Next to the red wire there is a yellow one.",
              "referenceName": "yellow wire"
            },
            {
              "feature": "At first, nothing happens. As if I hadn\u0027t done anything at all. \nThen, a small buzzing noise fills the small room, and my gaze is met by the robot\u0027s. \nI didn\u0027t even have time to react before he raised his gun and-",
              "correctWire": false,
              "givesGameOver": true,
              "description": "Beneath these two, I notice a green wire.",
              "referenceName": "green wire"
            }
          ],
          "lockedDoorReferenceName": "east door",
          "description": "My eyes linger on the three wires by its neck. One red, one green and one yellow.",
          "afarDescription": "There is a robot outside of the east door. I think it is guarding it? \nI can\u0027t go through unless I remove it somehow... \n",
          "referenceName": "robot"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Obstacle",
        "data": {
          "unlockedDescription": "The door is no longer blocked.",
          "lockable": {
            "type": "project.text.adventure.gameitems.Exit",
            "data": {
              "direction": "EAST",
              "toRoomReferenceName": "controlroom"
            }
          },
          "givesGameOver": false,
          "description": "I can\u0027t reach the door. The robot is in the way.",
          "referenceName": "east door"
        }
      }
    ],
    "referenceName": "transitionroom"
  },
  {
    "exits": [
      {
        "direction": "EAST",
        "toRoomReferenceName": "transitionroom"
      }
    ],
    "description": "Exits: East. \u003cbr/\u003eAs I step into the room, I\u0027m immediately blown away by the sheer office-feeling the room has.",
    "abstractItems": [
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "Upon closer inspection I notice a bunch of paper, sloppily written,as if the writer was in a haste. \nGeez. I can\u0027t read any of these.",
          "afarDescription": "There is a desk by the west wall and one of its drawers seems to be open.",
          "referenceName": "desk"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Box",
        "data": {
          "content": {
            "type": "project.text.adventure.gameitems.Article",
            "data": {
              "description": "I flip through the logs, only skimming over what seems interesting. \u003cbr/\u003e\u0027\u003ci\u003e30 days since departure: \u003cbr/\u003eThe crew seems to be doing just fine. Oxygen levels are stable. Hail Rowland! \u003cbr/\u003e50 days since departure: \u003cbr/\u003eA small disagreement in the common room today. Nothing new. Levels stable. \u003cbr/\u003e725 days since departure: \u003cbr/\u003eI am the only one awake. Why is no one here? \u003cbr/\u003eI am surviving solely because of the food in the common room. \u003cbr/\u003e800 days since departure: \u003cbr/\u003eI have managed to contact home. Long live Rowland! I hope I can bring my wife.\u0027 \u003cbr/\u003eThe corners of my mouth twitch a little, until I flip a page and notice the hastily written: \u003cbr/\u003e\u0027The fucking snakes have cut the oxygen. DO NOT TRUST THEM. DO NOT TRU\u003c/i\u003e\u0027 \u003cbr/\u003eI can feel a lump in my throat. \u003cbr/\u003eIs this...?",
              "afarDescription": "There seem to be a bunch of logs in here...",
              "referenceName": "logs"
            }
          },
          "open": false,
          "winsGame": false,
          "description": "The drawer is hanging loosely, as if forced open once.",
          "referenceName": "drawer"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Box",
        "data": {
          "content": {
            "type": "project.text.adventure.gameitems.Article",
            "data": {
              "description": "I skim through the text. There are alot of names I do not recognize.\u003cbr/\u003e \u0027President of our blessed country, Rowland\u0027, I read. Huh. Rowland is a strange name of a country. \u003cbr/\u003eI squint as I focus on the other two countries. Castilia... Orthodia. \u003cbr/\u003eMy stomach knots when I see the last one. Huh?",
              "afarDescription": "There is a confidential folder in this archive.",
              "referenceName": "folder"
            }
          },
          "open": false,
          "winsGame": false,
          "description": "Wow... \u003cbr/\u003eMaybe there is some valuable information inside? I should open it.",
          "afarDescription": "By the south wall I can see a grey, dusty archive.",
          "referenceName": "archive"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "Three red dots are pulsating on the map.\u003cbr/\u003eI squint as I try to read them. \u0027Rowland\u0027... \u0027Orthodia\u0027.... \u0027Castilia\u0027?.",
          "afarDescription": "In the middle of the room I notice a big machine, somewhat like a research machine?\u003cbr/\u003eDoes that make sense? \u003cbr/\u003eIt is displaying a huge hologram of... I suppose that\u0027s our planet?",
          "referenceName": "research machine"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Box",
        "data": {
          "content": {
            "type": "project.text.adventure.gameitems.Article",
            "data": {
              "description": "\u0027AI manual\u0027, I read, curiosity peaqued as I remember the robot outside. \u003cbr/\u003eAfter quickly skimming some pages I note that, in case of emergencies, one should cut the robot\u0027s yellow cord. \n",
              "afarDescription": "There is a manual hidden between two books.",
              "referenceName": "manual"
            }
          },
          "open": false,
          "winsGame": false,
          "description": "There are alot of interesting books... If only I had time to read! Wait... is that a manual?",
          "afarDescription": "There is a display shelf by the north wall. Inside there are alot of books... why are they this protected?",
          "referenceName": "display shelf"
        }
      }
    ],
    "referenceName": "researcharea"
  },
  {
    "exits": [
      {
        "direction": "SOUTH",
        "toRoomReferenceName": "transitionroom"
      }
    ],
    "description": "Exits: south\u003cbr/\u003eThere is a treadmill by the north wall and some dumbbells around it.\nBy the east wall there seems to be scanner... probaly for substances? But I don\u0027t know how to manuever it.\nAn X-ray is by the southeast wall.\nBy the west wall there is a bed and a monitor. It displays nothing.",
    "abstractItems": [
      {
        "type": "project.text.adventure.gameitems.Box",
        "data": {
          "content": {
            "type": "project.text.adventure.gameitems.Article",
            "data": {
              "description": "I squint to read the handwriting. Benzodiazepines? What?",
              "afarDescription": "Upon opening the cabinet, I notice a small, empty bottle.",
              "referenceName": "empty bottle"
            }
          },
          "open": false,
          "winsGame": false,
          "description": "I can see something small standing inside.",
          "afarDescription": "There is a medicine cabinet by the north wall.",
          "referenceName": "medicine cabinet"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Box",
        "data": {
          "content": {
            "type": "project.text.adventure.gameitems.Article",
            "data": {
              "description": "I pick it out carefully and open it. It contains information about just any medicine... \nMostly written about is benzodiazepines, commonly used for anxiety disorder. Beneath it I can see the doctor\u0027s notes:\u003cbr/\u003e\u0027\u003ci\u003eTested on three so far. High levels tested positive for anterogade amnesia.\u003cbr/\u003eProbability of usefulness in final drug: big. \u003cbr/\u003eDosage of new and improved drug resulting in retrogade amnesia has been successfully added to the pods. \u003cbr/\u003eWill be added if mission save Earth fails.\u003c/i\u003e\u0027 \u003cbr/\u003e... \u003cbr/\u003eWhat?",
              "afarDescription": "Do they need this many journals for so few passengers? I notice a thick journal, no doubt used many years. \u003cbr/\u003eThere must be something important in this... right?",
              "referenceName": "journal"
            }
          },
          "open": false,
          "winsGame": false,
          "description": "Something is stuck in the drawer so it isn\u0027t closed properly. It might be a journal, maybe I can find some useful information in this cabinet.",
          "afarDescription": "Next to the medicine cabinet there is another cabinet, it looks like the kind people keep journals in.",
          "referenceName": "cabinet"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Obstacle",
        "data": {
          "keyReferenceName": "key",
          "unlockedDescription": "",
          "lockable": {
            "type": "project.text.adventure.gameitems.Box",
            "data": {
              "content": {
                "type": "project.text.adventure.gameitems.Key",
                "data": {
                  "description": "The knife is sure too small to eat with. It is probably for surgery.",
                  "afarDescription": "Among the medicial tools I see a knife.",
                  "referenceName": "knife"
                }
              },
              "open": false,
              "winsGame": false,
              "description": "The tool box is clinicly white. No doubt they took care of this.",
              "afarDescription": "The tool box is unlocked.",
              "referenceName": "tool box"
            }
          },
          "givesGameOver": false,
          "description": "The box is clinicly white and... yep. Locked.",
          "afarDescription": "By the northwest wall there is a tool box.",
          "referenceName": "tool box"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "Wow... this gives me a headache. \nLook at all these chemical expressions and- \nMy gaze lingers by a strange bottle of medicine on the desk.",
          "afarDescription": "There is an experiment desk by the southeast wall.",
          "referenceName": "experiment desk"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "Oh no, that\u0027s way too heavy to carry!",
          "referenceName": "dumbbells"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "The treadmill looks like it hasn\u0027t been used for a while and is starting to become dusty.",
          "referenceName": "treadmill"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "I look closer at the scanner and I feel even more confused about how it works, maybe it\u0027s better to not toutch it...",
          "referenceName": "scanner"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "The bed looks comfortable, but I think it\u0027s more important to get out of here than to rest.",
          "referenceName": "bed"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "The x-ray seems to be turned off. Maybe I should just leave it, it won\u0027t help me get home anyways.",
          "referenceName": "x-ray"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "I can\u0027t find the power button, and I don\u0027t think it will get me home either.",
          "referenceName": "monitor"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Key",
        "data": {
          "description": "I can\u0027t read the label at all. Medicine is medicine I suppose?",
          "referenceName": "medicine"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Key",
        "data": {
          "description": "It is almost funny to see such an old-fashioned key in the high-tech facility.",
          "afarDescription": "Something seems to glimmer in the sterile light. I curiously walk closer, only to notice a key.",
          "referenceName": "key"
        }
      }
    ],
    "referenceName": "medicalfacility"
  },
  {
    "exits": [
      {
        "direction": "WEST",
        "toRoomReferenceName": "transitionroom"
      }
    ],
    "description": "Exits: west. \u003cbr/\u003eOn the east wall there are six transperent screens, like holograms,\nand through them I can see lots of stars across the otherwise dark sky in space. Just as I think\nI\u0027ve seen all there is in the room, something catches my eye.\n",
    "abstractItems": [
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "It\u0027s too high for me to reach, so there is nothing I can do with it.",
          "afarDescription": "Close to the ceiling there is a small ventilator, for keeping the air fresh I guess.",
          "referenceName": "ventilator"
        }
      },
      {
        "type": "project.text.adventure.gameitems.Article",
        "data": {
          "description": "I see collapsed buildings on five of the screens and they are burning as well as\nthe ground around them. On the sixth screen the fire has been put out. It looks like a small\nvillage and I see a few people walk around carrying tools and pieces of wood, as if they are\nrebuilding the town. \u003cbr/\u003eWhat happened here? Is this.. Earth? \u003cbr/\u003eIs it because of, whatever happened\nto make it look like this, that I am on space station?",
          "referenceName": "screens"
        }
      },
      {
        "type": "project.text.adventure.gameitems.ControlPanel",
        "data": {
          "buttons": [
            {
              "feature": "I hear a noise, like someone started a fan. \nSomething is starting to smell and I find it harder to breathe and I start \ncoughing. I see a green gas finding its way out of the ventilator...",
              "givesGameOver": true,
              "correctButton": false,
              "description": "I see a small label near the yellow button, \u0027Orthodia\u0027 it says.",
              "referenceName": "yellow button"
            },
            {
              "feature": "After I pressed the button everything is quitet for a moment then a red light is switched on.\nA warning-sign lights up on the control panel and I can feel the air getting thinner and thinner...",
              "givesGameOver": true,
              "correctButton": false,
              "description": "Next to the green button there is another label: \u0027Rowland\u0027.",
              "referenceName": "green button"
            },
            {
              "feature": "At first nothing happens. Then a massage \nappears on the control panel. \u0027\u003ci\u003eWe\u0027ve been looking for you, go to station\u0027s \nexit and we will pick you up shortly.\u003c/i\u003e\u0027 I read on the display.",
              "givesGameOver": false,
              "correctButton": true,
              "description": "As I look closer to the orange button I see \u0027Castilia\u0027 written next to it.",
              "referenceName": "orange button"
            },
            {
              "feature": "The lights go out as well as the control \npanel and the screens above them. Maybe this was not a good idea...",
              "givesGameOver": true,
              "correctButton": false,
              "description": "The power button is red, maybe I should stay away from this button.",
              "afarDescription": "",
              "referenceName": "power button"
            }
          ],
          "locksReferenceName": "hatch",
          "description": "On the control panel there are several buttons I feel like I probably should \nnot touch, like the power button. I also see a label saying \u0027contact government\u0027 and under \nit there are four buttons, one orange, one green and one yellow. Next to each button, on the control panel, something is written.",
          "afarDescription": "Underneath the screens, there is a hugh desk with lots of buttons \non it, I think it\u0027s some kind of control panel.",
          "referenceName": "control panel"
        }
      }
    ],
    "referenceName": "controlroom"
  }
]